DeltaNova/STM32/WS2812/ws2812.cpp
// ws2812.cpp
// Rewrite of I2CTest Code to create the appearance of concurrent operation of 
// the stepper motor, oled display and sensor readings without an RTOS. 
////////////////////////////////////////////////////////////////////////////////
#include <stdint.h>             // Enable fixed width integers
#include <stdio.h>              // Newlib-nano
#include <stdlib.h>             // rand()
#include <math.h>               // sin()
#include "buffer_class.h"       // Circular Buffer Class
#include "clock.h"              // Setup system and peripheral clocks
#include "delay.h"              // Simple Delay Function
#include "stm32f103xb.h"        // HW Specific Header

#include "leds/ledfx.h"         // WS2812 Effects Library

// LED Definitions
#define BYTES_PER_LED 24 // Number of bytes holding colour data for each LED.
#define NUM_LEDS 60
////////////////////////////////////////////////////////////////////////////////
// Function Declarations
extern "C" void SysTick_Handler(void);
//extern "C" void TIM2_IRQHandler(void);
extern "C" void DMA1_Channel5_IRQHandler(void);
void SysTick_Init(void);
void delay_ms(uint32_t ms);
void toggleLed();
void changeColour();
void PWM_Setup();      // Timer 2 PWM - Ch1 & Ch2
void DMA_Setup();
void Timebase_Setup(); // Timebase from Timer using interrupts
void PC13_LED_Setup(); // Setup PC13 for output LED
void writeLED(uint8_t (*colour)[3], uint8_t length, uint8_t *buffer);
void loadReset(uint8_t *array, uint8_t offset);
void setPixel(uint8_t colour[3], uint8_t pixel, uint8_t (&array)[NUM_LEDS][3]);
void setPixelRGB(uint8_t R, uint8_t G, uint8_t B, uint8_t pixel, uint8_t (&array)[NUM_LEDS][3]);
void setAll(uint8_t colour[3], uint8_t (&array)[NUM_LEDS][3]);
void setAllRGB(uint8_t R, uint8_t G, uint8_t B, uint8_t (&array)[NUM_LEDS][3]);
int getRandomNumber(int min, int max);

void ChristmasLightsStart();
void ChristmasLights();
////////////////////////////////////////////////////////////////////////////////
// Buffers
// -------
// Create buffers - Size defined by buffer_class.h or variable for compiler.
//Buffer serial_rx;
//Buffer serial_tx;
//Buffer rx_buffer;
////////////////////////////////////////////////////////////////////////////////
// Defines
// -------


uint8_t LED_COUNT = NUM_LEDS;      // Number of LEDs in string.

// RGB Colour Definitions - Reduced Brightness (Still very bright)
uint8_t RED2[] = {63,0,0};

#define RED     {63,0,0}
#define GREEN   {0,63,0}
#define BLUE    {0,0,63}
#define WHITE   {63,63,63}
#define PINK    {255,20,147}
#define OFF     {0,0,0}
#define BRIGHTWHITE {255,255,255}

static uint8_t pixels[NUM_LEDS][3]= {0};
/*
static uint8_t colour0[][3] = {RED, GREEN, OFF, WHITE, BLUE}; // Length 5
static uint8_t colour1[][3] = {RED, RED, WHITE, BLUE, BLUE}; // Length 5
static uint8_t colour2[][3] = {BRIGHTWHITE, BRIGHTWHITE, BRIGHTWHITE, BRIGHTWHITE,BRIGHTWHITE}; // Length 5

static uint8_t colour3[][3] = {GREEN, GREEN, GREEN, GREEN, GREEN};
static uint8_t colour4[][3] = {RED, GREEN, GREEN, GREEN, GREEN};
static uint8_t colour5[][3] = {GREEN, RED, GREEN, GREEN, GREEN};
static uint8_t colour6[][3] = {GREEN, GREEN, RED, GREEN, GREEN};
static uint8_t colour7[][3] = {GREEN, GREEN, GREEN, RED, GREEN};
static uint8_t colour8[][3] = {GREEN, GREEN, GREEN, GREEN, RED};
static uint8_t colour9[][3] = {PINK, PINK, PINK, PINK, PINK};
*/
////////////////////////////////////////////////////////////////////////////////
// Global Variables
volatile uint32_t ticks = 0;        // Used for SysTick count down.
volatile uint32_t flash = 0;        // Used for PC13 LED Flash Toggle Interval
volatile uint32_t colour_change = 6001; // Used LED Colour Change Interval

uint8_t colour_rotation = 0;         // Used in loading colour sequence.

static uint8_t currentLED = 0;      // Tracks LED write progress
// Points to the colour sequence being sent. Used to allow DMA_ISR to load
// data into buffer.
static uint8_t (*LEDSequence)[3];
static uint32_t counter; // Holds a ms countdown value
// The DMA Buffer needs to be able to hold the data for 2 LEDs. When the data
// for one LED is sent the DMA HT (Half Transfer) Flag is set. After the data 
// for the next LED is send the DMA TC (Transfer Complete) Flag is set. 
// The DMA transfer is setup for cicular mode and will then wrap around to the
// start.
uint8_t DMA_Buffer[2*BYTES_PER_LED] = {};
////////////////////////////////////////////////////////////////////////////////
// Main - Called by the startup code.
int main(void) {
    ClockSetup();       // Setup System & Peripheral Clocks
    SysTick_Init();     // Enable SysTick
    PC13_LED_Setup();   // Setup PC13 for output LED
    DMA_Setup();
    PWM_Setup();

    // The counter will count to the reload value where upon it will toggle the
    // output state of each channel back to its reset value. 
    // During the count, before the reload value is reached, the count is 
    // compared with each channels compare value. If the compare value is
    // matched the output state of the matched channel will be toggled.
    
    // Timer 2 Channel 1 Compare Value
    //TIM2->CCR1 = 0x000F;        // 15 (Logic 1)
    TIM2->CCR1 = 0x0000; 
    // Timer 2 Channel 2 Compare Value
    TIM2->CCR2 = 0x0009;        // 9 (Logic 0)
    //delay_ms(2000);
    //ChristmasLightsStart();
    while(1){
        // Triggers Every Second
        toggleLed();    // Toggle LED (PC13)  to indicate loop operational
        
        // Triggers Every 6 Seconds
        //changeColour(); // Change the colours of the WS2812B LEDS
        
        /* Not Working as expected with more than 5 LEDS
        // Green with single reg strobe. Delay added to slow update rate
        writeLED(colour3, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour4, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour5, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour6, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour7, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour8, 5, DMA_Buffer);
        delay_ms(1000);
        writeLED(colour9, 5, DMA_Buffer);
        delay_ms(1000);
        */
        
        
        //setAllRGB(0,0,0,pixels);
        
        //setPixel(RED2,0,pixels);
        //setPixelRGB(0,0,63,1,pixels);
        //setPixelRGB(255,20,147,2,pixels);
        //writeLED(pixels,NUM_LEDS, DMA_Buffer);
        //delay_ms(1000);
        /*
        setAllRGB(138,43,226, pixels);
        writeLED(pixels,NUM_LEDS, DMA_Buffer);
        delay_ms(1000);
        
        setAllRGB(255,255,255, pixels);
        writeLED(pixels,NUM_LEDS, DMA_Buffer);
        delay_ms(1000);
        
        setAllRGB(250,20,147, pixels);
        writeLED(pixels,NUM_LEDS, DMA_Buffer);
        delay_ms(4000);
        
        setAll(RED2, pixels);
        writeLED(pixels,NUM_LEDS, DMA_Buffer);
        delay_ms(1000);
        */
        //RGBLoop(pixels);
        
