DeltaNova/STM32/WS2812/ws2812.cpp
        //Sparkle(255,255,255,pixels,3); // White Sparkle
        //Sparkle(getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,255),pixels,3);
        //CylonBounce(255,0,0,4,10,50);
        //Strobe(255,0x77,0,10,100,1000); //Slow
        //Strobe(255,255,255,10,50,1000); //Fast
        //Twinkle(255,0,0,10,100,false);
        //TwinkleRandom(20,100,false);
        //SnowSparkle(0x10, 0x10, 0x10, 20, getRandomNumber(100,1000));
        //RunningLights(255,255,0,50);  //Yellow
        //RunningLights(255,0,0,50); //RED
        //RunningLights(255,255,255,pixels,50);//WHITE
        //RunningLights(0,0,255,50); //BLUE
        //colorWipe(0x00,0xff,0x00, pixels, 50);
        //colorWipe(0x00,0x00,0x00, pixels, 50);
        //theaterChase(0xff,0,0,50);
        //Fire(55,120,15);
       //ChristmasLights();
       //theaterChaseRainbow(2); 
       meteorRain(0xad,0x33,0xff,10, 64, true, 30);
    }
}
 void ChristmasLightsStart(){
     // My Chrsitmas Light Display
        setAllRGB(0,0,0,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(25,0,0,0,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(25,0,0,1,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,2,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,3,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,4,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,5,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        setPixelRGB(25,0,0,6,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(50,0,0,4,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(50,0,0,2,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(50,0,0,3,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        
        setPixelRGB(128,0,0,2,pixels);
        setPixelRGB(128,0,0,3,pixels);
        setPixelRGB(128,0,0,4,pixels);
        writeLED(pixels,NUM_LEDS,DMA_Buffer);
        delay_ms(1000);
        uint8_t i;
        for (i=0; i < 10; i++){
            CylonBounce(255,0,0,4,10,50);
        }
}


void ChristmasLights(){
    uint8_t i;
    for (i=0; i < 6; i++){
        CylonBounce(255,255,255,4,10,50);
    }
    colorWipe(0x10,0x10,0x10,pixels,40);
    counter = 30000;
    while(counter){
        SnowSparkle(0x10, 0x10, 0x10, pixels, 20, getRandomNumber(100,1000));
    }
    
    Strobe(255,255,255,10,50,1000); //Fast
    
    colorWipe(0x32, 0x2d, 0x91,pixels,20);
    colorWipe(0xe6, 0xd1, 0x17,pixels,20);
    colorWipe(0x73, 0x12, 0x1f,pixels,20);
    colorWipe(0x61, 0xa3, 0xe6,pixels,20);
    colorWipe(0xe6, 0x89, 0x10,pixels,20);
    colorWipe(0x65, 0xbf, 0x74,pixels,20);
    
    CylonBounce(0x25,0x73,0x22,4,10,30);
    
    counter = 15000;
    while(counter){
        Sparkle(255,255,255,pixels,3); // White Sparkle
    }
    
    counter = 15000;
    while(counter){
        Sparkle(getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,255),pixels,3);
    }
    

    RunningLights(255,255,255,pixels,30);//WHITE

    CylonBounce(0xad,0x1a,0x4b,4,10,30);

    for(i = 0; i<3; i++){
        theaterChase(0xff,0,0,30);
    }
    
    for(i = 0; i<3; i++){
        theaterChase(0x0c,0x5e,0x9c,20);
    }
    
     for(i = 0; i<3; i++){
        theaterChase(0x97,0x21,0x9C,10);
    }
    
    colorWipe(0xff, 0xbd, 0x38,pixels,20);
    colorWipe(0x17, 0xc5, 0x15,pixels,20);
    colorWipe(0x5c, 0x19, 0x1d,pixels,20);
    colorWipe(0x64, 0x37, 0x88,pixels,20);
    colorWipe(0xc4, 0x2d, 0xba,pixels,20);
    
    counter = 30000;
    while(counter){
        Fire(55,120,15);
    }
}




int getRandomNumber(int min, int max){
    // Generate a random number between min and max (inclusive)
    // Assumes std::srand() has already been called
    // Assumes max - min <= RAND_MAX
    static const double fraction = 1.0 / (RAND_MAX + 1.0);  // static used for efficiency, so we only calculate this value once
    // evenly distribute the random number across our range
    return min + static_cast<int>((max - min + 1) * (std::rand() * fraction));
}



    
void loadColour(uint8_t *colour, uint8_t *array, uint8_t offset){
    // Load a colour into an array. An offset is provided to enable
    // multiple colours to be loaded into the same array at differnt points.
    uint8_t i;
    /*
    // colour is an RGB Array
    // colour[0] = RED Component
    // colour[1] = GREEN Component
    // colour[2] = BLUE Component
    // Order for output array is GRB
    */
    for(i=0; i<8; i++){ // Load GREEN Component
        array[i+offset] = ((colour[1]<<i) & 0x80) ? 0x0F:0x09;
    }
    for(i=0; i<8; i++){ // Load RED Component (Offset by 8 bits from GREEN)
        array[i+offset+8] = ((colour[0]<<i) & 0x80) ? 0x0F:0x09;
    }
    for(i=0; i<8; i++){ // Load BLUE Component (Offset by 16 bits from GREEN)
        array[i+offset+16] = ((colour[2]<<i) & 0x80) ? 0x0F:0x09;
    }
   
}

void loadReset(uint8_t *array, uint8_t offset){
    // Load zeros into buffer to generate PWM reset period.
    uint8_t i;
    for (i=0; i<BYTES_PER_LED; i++){
        array[i+offset] = 0x00;    
    }    
}    

void writeLED(uint8_t (*colour)[3], uint8_t length, uint8_t *buffer){
    /*
    // Setup the transfer of colour information to the LEDS.
    // This function loads the initial information into the array buffer and
    // tracks the progress using the global currentLED variable.
    // The transfer is started. The data that initially isn't within the
    // buffer is loaded later when the DMA HT/TC interrups trigger.
    */
    
    
    if (length <1){
        // No data to send. Return without doing anything else.
        return; 
    }
    
    // Check for exisiting write (Timer and DMA Enabled).
    // Continue when previous write has finished.
    while((TIM2->CR1 & 0x0001) && (DMA1_Channel5->CCR & 0x00000001)){
        // Wait until previous write has finished
    }
    
    // Store the sequence being sent so it can be referenced by the ISR.
    LEDSequence = colour; 
    
    currentLED = 0; // Reset Global variable
    
    if (currentLED < length){
        // Load the colour data into the DMA Buffer (1st Half)
        loadColour(LEDSequence[currentLED], buffer, 0);
    }else{
        loadReset(buffer,0);
    }
    
    currentLED++; // Next LED
    
    if (currentLED < length){
        // Load the colour data into the DMA Buffer (2nd Half)
        loadColour(LEDSequence[currentLED], buffer, BYTES_PER_LED);
    }else{
        loadReset(buffer,BYTES_PER_LED);
    }
    
    currentLED++; // Next LED
    
